src/integrationTest/resources/pm-templates/v3/core/persona-creation-and-setup/user-creation/latest-api-version.request.yaml

$kind: http-request
description: Login to Salesforce
url: "{{baseUrl}}/services/data/"
method: GET
headers:
  Content-Type: text/xml
  SOAPAction: login
  charset: UTF-8
  Accept: text/xml
body:
  type: text
  content: |-
    <?xml version="1.0" encoding="utf-8" ?>
    <env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
      <env:Body>
        <n1:login xmlns:n1="urn:partner.soap.sforce.com">
          <n1:username><![CDATA[{{username}}]]></n1:username>
          <n1:password><![CDATA[{{password}}]]></n1:password>
        </n1:login>
      </env:Body>
    </env:Envelope>
scripts:
  - type: afterResponse
    code: |-
      var jsonData = pm.response.json();
      var lastNode = jsonData.pop();
      pm.environment.set("version", lastNode.version);
      pm.environment.set("apiVersion", "v" + lastNode.version);
      pm.environment.set("versionPath", lastNode.url);
    language: text/javascript
settings:
  disabledSystemHeaders:
    - accept
    - content-type
order: 1000
